# GalPerMin Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..GalPerMin Property
SymbolTypeId Class See Also
---
Symbol gal/min, indicating unit US gallons per minute.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId GalPerMin { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GalPerMin As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GalPerMin {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace